###############################################################################
# Created by write_sdc
# Tue Sep 20 19:40:50 2022
###############################################################################
current_design ALU
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 1000.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {funct3[0]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {funct3[1]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {funct3[2]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {funct7[0]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {funct7[1]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {funct7[2]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {funct7[3]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {funct7[4]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {funct7[5]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {funct7[6]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[0]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[10]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[11]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[12]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[13]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[14]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[15]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[16]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[17]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[18]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[19]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[1]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[20]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[21]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[22]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[23]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[24]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[25]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[26]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[27]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[28]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[29]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[2]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[30]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[31]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[3]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[4]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[5]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[6]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[7]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[8]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[9]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate_sel}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_type[0]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_type[1]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_type[2]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_type[3]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_type[4]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {instruction_type[5]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {la_reg_select[0]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {la_reg_select[1]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {la_reg_select[2]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {la_reg_select[3]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {la_reg_select[4]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {opcode[0]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {opcode[1]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {opcode[2]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {opcode[3]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {opcode[4]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {opcode[5]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {opcode[6]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[0]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[10]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[11]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[12]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[13]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[14]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[15]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[16]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[17]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[18]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[19]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[1]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[20]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[21]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[22]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[23]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[24]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[25]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[26]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[27]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[28]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[29]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[2]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[30]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[31]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[3]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[4]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[5]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[6]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[7]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[8]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[9]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd[0]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd[1]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd[2]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd[3]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd[4]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_data[0]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_data[10]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_data[11]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_data[12]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_data[13]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_data[14]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_data[15]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_data[16]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_data[17]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_data[18]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_data[19]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_data[1]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_data[20]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_data[21]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_data[22]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_data[23]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_data[24]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_data[25]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_data[26]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_data[27]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_data[28]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_data[29]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_data[2]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_data[30]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_data[31]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_data[3]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_data[4]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_data[5]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_data[6]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_data[7]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_data[8]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_data[9]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_write}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1[0]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1[1]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1[2]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1[3]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1[4]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs2[0]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs2[1]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs2[2]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs2[3]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs2[4]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rst_n}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_output[0]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_output[10]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_output[11]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_output[12]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_output[13]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_output[14]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_output[15]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_output[16]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_output[17]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_output[18]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_output[19]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_output[1]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_output[20]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_output[21]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_output[22]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_output[23]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_output[24]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_output[25]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_output[26]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_output[27]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_output[28]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_output[29]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_output[2]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_output[30]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_output[31]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_output[3]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_output[4]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_output[5]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_output[6]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_output[7]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_output[8]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_output[9]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {la_read_data[0]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {la_read_data[10]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {la_read_data[11]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {la_read_data[12]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {la_read_data[13]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {la_read_data[14]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {la_read_data[15]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {la_read_data[16]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {la_read_data[17]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {la_read_data[18]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {la_read_data[19]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {la_read_data[1]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {la_read_data[20]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {la_read_data[21]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {la_read_data[22]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {la_read_data[23]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {la_read_data[24]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {la_read_data[25]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {la_read_data[26]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {la_read_data[27]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {la_read_data[28]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {la_read_data[29]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {la_read_data[2]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {la_read_data[30]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {la_read_data[31]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {la_read_data[3]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {la_read_data[4]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {la_read_data[5]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {la_read_data[6]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {la_read_data[7]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {la_read_data[8]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {la_read_data[9]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[0]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[10]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[11]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[12]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[13]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[14]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[15]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[16]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[17]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[18]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[19]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[1]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[20]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[21]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[22]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[23]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[24]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[25]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[26]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[27]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[28]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[29]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[2]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[30]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[31]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[3]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[4]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[5]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[6]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[7]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[8]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[9]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs2_data[0]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs2_data[10]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs2_data[11]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs2_data[12]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs2_data[13]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs2_data[14]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs2_data[15]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs2_data[16]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs2_data[17]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs2_data[18]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs2_data[19]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs2_data[1]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs2_data[20]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs2_data[21]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs2_data[22]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs2_data[23]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs2_data[24]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs2_data[25]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs2_data[26]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs2_data[27]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs2_data[28]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs2_data[29]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs2_data[2]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs2_data[30]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs2_data[31]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs2_data[3]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs2_data[4]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs2_data[5]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs2_data[6]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs2_data[7]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs2_data[8]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs2_data[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {alu_output[31]}]
set_load -pin_load 0.0334 [get_ports {alu_output[30]}]
set_load -pin_load 0.0334 [get_ports {alu_output[29]}]
set_load -pin_load 0.0334 [get_ports {alu_output[28]}]
set_load -pin_load 0.0334 [get_ports {alu_output[27]}]
set_load -pin_load 0.0334 [get_ports {alu_output[26]}]
set_load -pin_load 0.0334 [get_ports {alu_output[25]}]
set_load -pin_load 0.0334 [get_ports {alu_output[24]}]
set_load -pin_load 0.0334 [get_ports {alu_output[23]}]
set_load -pin_load 0.0334 [get_ports {alu_output[22]}]
set_load -pin_load 0.0334 [get_ports {alu_output[21]}]
set_load -pin_load 0.0334 [get_ports {alu_output[20]}]
set_load -pin_load 0.0334 [get_ports {alu_output[19]}]
set_load -pin_load 0.0334 [get_ports {alu_output[18]}]
set_load -pin_load 0.0334 [get_ports {alu_output[17]}]
set_load -pin_load 0.0334 [get_ports {alu_output[16]}]
set_load -pin_load 0.0334 [get_ports {alu_output[15]}]
set_load -pin_load 0.0334 [get_ports {alu_output[14]}]
set_load -pin_load 0.0334 [get_ports {alu_output[13]}]
set_load -pin_load 0.0334 [get_ports {alu_output[12]}]
set_load -pin_load 0.0334 [get_ports {alu_output[11]}]
set_load -pin_load 0.0334 [get_ports {alu_output[10]}]
set_load -pin_load 0.0334 [get_ports {alu_output[9]}]
set_load -pin_load 0.0334 [get_ports {alu_output[8]}]
set_load -pin_load 0.0334 [get_ports {alu_output[7]}]
set_load -pin_load 0.0334 [get_ports {alu_output[6]}]
set_load -pin_load 0.0334 [get_ports {alu_output[5]}]
set_load -pin_load 0.0334 [get_ports {alu_output[4]}]
set_load -pin_load 0.0334 [get_ports {alu_output[3]}]
set_load -pin_load 0.0334 [get_ports {alu_output[2]}]
set_load -pin_load 0.0334 [get_ports {alu_output[1]}]
set_load -pin_load 0.0334 [get_ports {alu_output[0]}]
set_load -pin_load 0.0334 [get_ports {la_read_data[31]}]
set_load -pin_load 0.0334 [get_ports {la_read_data[30]}]
set_load -pin_load 0.0334 [get_ports {la_read_data[29]}]
set_load -pin_load 0.0334 [get_ports {la_read_data[28]}]
set_load -pin_load 0.0334 [get_ports {la_read_data[27]}]
set_load -pin_load 0.0334 [get_ports {la_read_data[26]}]
set_load -pin_load 0.0334 [get_ports {la_read_data[25]}]
set_load -pin_load 0.0334 [get_ports {la_read_data[24]}]
set_load -pin_load 0.0334 [get_ports {la_read_data[23]}]
set_load -pin_load 0.0334 [get_ports {la_read_data[22]}]
set_load -pin_load 0.0334 [get_ports {la_read_data[21]}]
set_load -pin_load 0.0334 [get_ports {la_read_data[20]}]
set_load -pin_load 0.0334 [get_ports {la_read_data[19]}]
set_load -pin_load 0.0334 [get_ports {la_read_data[18]}]
set_load -pin_load 0.0334 [get_ports {la_read_data[17]}]
set_load -pin_load 0.0334 [get_ports {la_read_data[16]}]
set_load -pin_load 0.0334 [get_ports {la_read_data[15]}]
set_load -pin_load 0.0334 [get_ports {la_read_data[14]}]
set_load -pin_load 0.0334 [get_ports {la_read_data[13]}]
set_load -pin_load 0.0334 [get_ports {la_read_data[12]}]
set_load -pin_load 0.0334 [get_ports {la_read_data[11]}]
set_load -pin_load 0.0334 [get_ports {la_read_data[10]}]
set_load -pin_load 0.0334 [get_ports {la_read_data[9]}]
set_load -pin_load 0.0334 [get_ports {la_read_data[8]}]
set_load -pin_load 0.0334 [get_ports {la_read_data[7]}]
set_load -pin_load 0.0334 [get_ports {la_read_data[6]}]
set_load -pin_load 0.0334 [get_ports {la_read_data[5]}]
set_load -pin_load 0.0334 [get_ports {la_read_data[4]}]
set_load -pin_load 0.0334 [get_ports {la_read_data[3]}]
set_load -pin_load 0.0334 [get_ports {la_read_data[2]}]
set_load -pin_load 0.0334 [get_ports {la_read_data[1]}]
set_load -pin_load 0.0334 [get_ports {la_read_data[0]}]
set_load -pin_load 0.0334 [get_ports {rs1_data[31]}]
set_load -pin_load 0.0334 [get_ports {rs1_data[30]}]
set_load -pin_load 0.0334 [get_ports {rs1_data[29]}]
set_load -pin_load 0.0334 [get_ports {rs1_data[28]}]
set_load -pin_load 0.0334 [get_ports {rs1_data[27]}]
set_load -pin_load 0.0334 [get_ports {rs1_data[26]}]
set_load -pin_load 0.0334 [get_ports {rs1_data[25]}]
set_load -pin_load 0.0334 [get_ports {rs1_data[24]}]
set_load -pin_load 0.0334 [get_ports {rs1_data[23]}]
set_load -pin_load 0.0334 [get_ports {rs1_data[22]}]
set_load -pin_load 0.0334 [get_ports {rs1_data[21]}]
set_load -pin_load 0.0334 [get_ports {rs1_data[20]}]
set_load -pin_load 0.0334 [get_ports {rs1_data[19]}]
set_load -pin_load 0.0334 [get_ports {rs1_data[18]}]
set_load -pin_load 0.0334 [get_ports {rs1_data[17]}]
set_load -pin_load 0.0334 [get_ports {rs1_data[16]}]
set_load -pin_load 0.0334 [get_ports {rs1_data[15]}]
set_load -pin_load 0.0334 [get_ports {rs1_data[14]}]
set_load -pin_load 0.0334 [get_ports {rs1_data[13]}]
set_load -pin_load 0.0334 [get_ports {rs1_data[12]}]
set_load -pin_load 0.0334 [get_ports {rs1_data[11]}]
set_load -pin_load 0.0334 [get_ports {rs1_data[10]}]
set_load -pin_load 0.0334 [get_ports {rs1_data[9]}]
set_load -pin_load 0.0334 [get_ports {rs1_data[8]}]
set_load -pin_load 0.0334 [get_ports {rs1_data[7]}]
set_load -pin_load 0.0334 [get_ports {rs1_data[6]}]
set_load -pin_load 0.0334 [get_ports {rs1_data[5]}]
set_load -pin_load 0.0334 [get_ports {rs1_data[4]}]
set_load -pin_load 0.0334 [get_ports {rs1_data[3]}]
set_load -pin_load 0.0334 [get_ports {rs1_data[2]}]
set_load -pin_load 0.0334 [get_ports {rs1_data[1]}]
set_load -pin_load 0.0334 [get_ports {rs1_data[0]}]
set_load -pin_load 0.0334 [get_ports {rs2_data[31]}]
set_load -pin_load 0.0334 [get_ports {rs2_data[30]}]
set_load -pin_load 0.0334 [get_ports {rs2_data[29]}]
set_load -pin_load 0.0334 [get_ports {rs2_data[28]}]
set_load -pin_load 0.0334 [get_ports {rs2_data[27]}]
set_load -pin_load 0.0334 [get_ports {rs2_data[26]}]
set_load -pin_load 0.0334 [get_ports {rs2_data[25]}]
set_load -pin_load 0.0334 [get_ports {rs2_data[24]}]
set_load -pin_load 0.0334 [get_ports {rs2_data[23]}]
set_load -pin_load 0.0334 [get_ports {rs2_data[22]}]
set_load -pin_load 0.0334 [get_ports {rs2_data[21]}]
set_load -pin_load 0.0334 [get_ports {rs2_data[20]}]
set_load -pin_load 0.0334 [get_ports {rs2_data[19]}]
set_load -pin_load 0.0334 [get_ports {rs2_data[18]}]
set_load -pin_load 0.0334 [get_ports {rs2_data[17]}]
set_load -pin_load 0.0334 [get_ports {rs2_data[16]}]
set_load -pin_load 0.0334 [get_ports {rs2_data[15]}]
set_load -pin_load 0.0334 [get_ports {rs2_data[14]}]
set_load -pin_load 0.0334 [get_ports {rs2_data[13]}]
set_load -pin_load 0.0334 [get_ports {rs2_data[12]}]
set_load -pin_load 0.0334 [get_ports {rs2_data[11]}]
set_load -pin_load 0.0334 [get_ports {rs2_data[10]}]
set_load -pin_load 0.0334 [get_ports {rs2_data[9]}]
set_load -pin_load 0.0334 [get_ports {rs2_data[8]}]
set_load -pin_load 0.0334 [get_ports {rs2_data[7]}]
set_load -pin_load 0.0334 [get_ports {rs2_data[6]}]
set_load -pin_load 0.0334 [get_ports {rs2_data[5]}]
set_load -pin_load 0.0334 [get_ports {rs2_data[4]}]
set_load -pin_load 0.0334 [get_ports {rs2_data[3]}]
set_load -pin_load 0.0334 [get_ports {rs2_data[2]}]
set_load -pin_load 0.0334 [get_ports {rs2_data[1]}]
set_load -pin_load 0.0334 [get_ports {rs2_data[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate_sel}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_write}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst_n}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {funct3[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {funct3[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {funct3[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {funct7[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {funct7[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {funct7[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {funct7[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {funct7[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {funct7[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {funct7[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instruction_type[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instruction_type[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instruction_type[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instruction_type[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instruction_type[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instruction_type[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_reg_select[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_reg_select[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_reg_select[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_reg_select[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_reg_select[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {opcode[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {opcode[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {opcode[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {opcode[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {opcode[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {opcode[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {opcode[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pc[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pc[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pc[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pc[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pc[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pc[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pc[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pc[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pc[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pc[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pc[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pc[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pc[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pc[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pc[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pc[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pc[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pc[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pc[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pc[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pc[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pc[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pc[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pc[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pc[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pc[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pc[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pc[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pc[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pc[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pc[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pc[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rd[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rd[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rd[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rd[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rd[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_data[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_data[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_data[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_data[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_data[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_data[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_data[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_data[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_data[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_data[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_data[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_data[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_data[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_data[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_data[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_data[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_data[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_data[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_data[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_data[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_data[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_data[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_data[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_data[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_data[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_data[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_data[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_data[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_data[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_data[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_data[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_data[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rs1[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rs1[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rs1[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rs1[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rs1[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rs2[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rs2[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rs2[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rs2[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rs2[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 10.0000 [current_design]
