###############################################################################
# Created by write_sdc
# Tue Sep 20 18:50:45 2022
###############################################################################
current_design pc
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 1000.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_branch}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {branch}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[0]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[10]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[11]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[12]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[13]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[14]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[15]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[16]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[17]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[18]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[19]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[1]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[20]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[21]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[22]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[23]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[24]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[25]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[26]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[27]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[28]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[29]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[2]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[30]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[31]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[3]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[4]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[5]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[6]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[7]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[8]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {immediate[9]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {jump_jal}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {jump_jalr}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[0]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[10]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[11]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[12]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[13]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[14]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[15]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[16]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[17]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[18]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[19]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[1]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[20]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[21]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[22]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[23]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[24]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[25]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[26]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[27]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[28]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[29]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[2]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[30]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[31]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[3]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[4]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[5]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[6]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[7]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[8]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rs1_data[9]}]
set_input_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rst_n}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[0]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[10]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[11]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[12]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[13]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[14]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[15]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[16]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[17]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[18]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[19]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[1]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[20]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[21]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[22]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[23]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[24]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[25]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[26]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[27]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[28]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[29]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[2]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[30]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[31]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[3]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[4]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[5]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[6]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[7]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[8]}]
set_output_delay 200.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {pc_out[31]}]
set_load -pin_load 0.0334 [get_ports {pc_out[30]}]
set_load -pin_load 0.0334 [get_ports {pc_out[29]}]
set_load -pin_load 0.0334 [get_ports {pc_out[28]}]
set_load -pin_load 0.0334 [get_ports {pc_out[27]}]
set_load -pin_load 0.0334 [get_ports {pc_out[26]}]
set_load -pin_load 0.0334 [get_ports {pc_out[25]}]
set_load -pin_load 0.0334 [get_ports {pc_out[24]}]
set_load -pin_load 0.0334 [get_ports {pc_out[23]}]
set_load -pin_load 0.0334 [get_ports {pc_out[22]}]
set_load -pin_load 0.0334 [get_ports {pc_out[21]}]
set_load -pin_load 0.0334 [get_ports {pc_out[20]}]
set_load -pin_load 0.0334 [get_ports {pc_out[19]}]
set_load -pin_load 0.0334 [get_ports {pc_out[18]}]
set_load -pin_load 0.0334 [get_ports {pc_out[17]}]
set_load -pin_load 0.0334 [get_ports {pc_out[16]}]
set_load -pin_load 0.0334 [get_ports {pc_out[15]}]
set_load -pin_load 0.0334 [get_ports {pc_out[14]}]
set_load -pin_load 0.0334 [get_ports {pc_out[13]}]
set_load -pin_load 0.0334 [get_ports {pc_out[12]}]
set_load -pin_load 0.0334 [get_ports {pc_out[11]}]
set_load -pin_load 0.0334 [get_ports {pc_out[10]}]
set_load -pin_load 0.0334 [get_ports {pc_out[9]}]
set_load -pin_load 0.0334 [get_ports {pc_out[8]}]
set_load -pin_load 0.0334 [get_ports {pc_out[7]}]
set_load -pin_load 0.0334 [get_ports {pc_out[6]}]
set_load -pin_load 0.0334 [get_ports {pc_out[5]}]
set_load -pin_load 0.0334 [get_ports {pc_out[4]}]
set_load -pin_load 0.0334 [get_ports {pc_out[3]}]
set_load -pin_load 0.0334 [get_ports {pc_out[2]}]
set_load -pin_load 0.0334 [get_ports {pc_out[1]}]
set_load -pin_load 0.0334 [get_ports {pc_out[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {alu_branch}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {branch}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {jump_jal}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {jump_jalr}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst_n}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {immediate[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rs1_data[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rs1_data[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rs1_data[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rs1_data[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rs1_data[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rs1_data[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rs1_data[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rs1_data[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rs1_data[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rs1_data[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rs1_data[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rs1_data[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rs1_data[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rs1_data[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rs1_data[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rs1_data[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rs1_data[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rs1_data[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rs1_data[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rs1_data[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rs1_data[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rs1_data[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rs1_data[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rs1_data[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rs1_data[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rs1_data[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rs1_data[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rs1_data[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rs1_data[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rs1_data[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rs1_data[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rs1_data[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 10.0000 [current_design]
